---
kind: property
id: P:Autodesk.Revit.DB.Lighting.AdvancedLossFactor.SurfaceDepreciationLossFactor
source: html/85a1df84-025b-4643-0e8a-4385768a4974.htm
---
# Autodesk.Revit.DB.Lighting.AdvancedLossFactor.SurfaceDepreciationLossFactor Property

The surface depreciation loss factor.

## Syntax (C#)
```csharp
public double SurfaceDepreciationLossFactor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0.